<a href="https://colab.research.google.com/github/pranavkerkar31/AI-ML/blob/main/Pandas1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [13]:
a=pd.Series([10,20,30,40,50,60])
a

0    10
1    20
2    30
3    40
4    50
5    60
dtype: int64

In [6]:
a.dtype
a.values
a.index

RangeIndex(start=0, stop=6, step=1)

In [14]:
a.name='Calories'
a.name

'Calories'

Indexing

In [15]:
a[0:2]

0    10
1    20
Name: Calories, dtype: int64

Location based indexing

In [9]:
# using iloc
a.iloc[2]
a.iloc[[0,1,2]] # to fetch multiple values at index

np.int64(3)

In [16]:
fruits = ["apple",'banana','grapes','guava0','chiku','pineapple']
fruits
a.index=fruits
a

apple        10
banana       20
grapes       30
guava0       40
chiku        50
pineapple    60
Name: Calories, dtype: int64

In [18]:
a['apple']

np.int64(10)

Lable based Indexing

In [21]:
people_age = {
    "Rahul": 21,
    "Anita": 19,
    "Suresh": 25,
    "Priya": 22,
    "Amit": 24,
    "Neha": 20
}
series = pd.Series(people_age,name='Age')
series

Rahul     21
Anita     19
Suresh    25
Priya     22
Amit      24
Neha      20
Name: Age, dtype: int64

CONDITIONAL INDEXING

In [24]:
print(series>20)
series[series>20]

Rahul      True
Anita     False
Suresh     True
Priya      True
Amit       True
Neha      False
Name: Age, dtype: bool

Rahul     21
Suresh    25
Priya     22
Amit      24
Name: Age, dtype: int64

Logical Operation

In [26]:
series[(series>20) & (series<30)]

Rahul     21
Suresh    25
Priya     22
Amit      24
Name: Age, dtype: int64

In [27]:
series['Rahul']=22 # modifying the colomn
series

Rahul     22
Anita     19
Suresh    25
Priya     22
Amit      24
Neha      20
Name: Age, dtype: int64